const MIN_LIKES = 15;
const MAX_LIKES = 200;
const MIN_COMMENTS = 0;
const MAX_COMMENTS = 30;
const MIN_AVATAR_NUMBER = 0;
const MAX_AVATAR_NUMBER = 6;

const MESSAGES = ['Всё отлично!', 'Всё отлично! Но не всё.', 'В целом всё неплохо.', 'В целом всё неплохо. Но не всё.', 'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.', 'Когда вы делаете фотографию, хорошо бы убирать палец из кадра.', 'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.', 'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.', 'Лица у людей на фотке перекошены, как будто их избивают.', 'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!', 'Как можно было поймать такой неудачный момент?!'];

const USER_NAMES = ['Фрося', 'Ваня', 'Петя', 'Паша', 'Катя', 'Кристина', 'Вика', 'Савелий', 'Игорь', 'Денис', 'Марк', 'Максим', 'Даша', 'Глаша', 'Егор', 'Александр', 'Михаил', 'Сергей', 'Тимофей', 'Алексей', 'Петр', 'Виктория', 'Жанна', 'Диана', 'Павел'];

export {MIN_LIKES, MAX_LIKES, MIN_COMMENTS, MAX_COMMENTS, MIN_AVATAR_NUMBER, MAX_AVATAR_NUMBER, MESSAGES, USER_NAMES};
